In [6]:
import pandas as p 
import numpy as n

In [7]:
from sqlalchemy import create_engine

In [8]:
temp_db = create_engine('sqlite:///:memory:')

In [10]:
df = p.DataFrame(data=n.random.randint(low=0,high=100,size=(4,4)),columns=['a','b','c','d'])

In [11]:
df

    a   b   c   d
0  69  45  76  95
1  25  75  20  49
2  87  98  56  39
3  73  18  29  81

In [22]:
df.to_sql(name='new_Table',con=temp_db)

4

In [ ]:
#new_df = p.read_sql(sql='newTb',con='temp_db')

In [24]:
new_df = p.read_sql(sql='new_Table',con=temp_db)

In [25]:
new_df

   index   a   b   c   d
0      0  69  45  76  95
1      1  25  75  20  49
2      2  87  98  56  39
3      3  73  18  29  81

In [26]:
p.read_sql_query(sql='select a,c from new_Table', con=temp_db)

    a   c
0  69  76
1  25  20
2  87  56
3  73  29